**21-03-03 python 09_파일 입출력 프로그래밍 (c)cherryuki (ji)**

# <font color="red">ch10. 데이터베이스 연동</font>

# 1절. SQLite 데이터 베이스 연결
## 1.1 SQLite와 Python
- SQLite 데이터 베이스는 별도의 서버 프로세스 없이 SQL을 사용하여 DB 액세스 할 수 있도록 만든 간단한 디스크 기반 데이터 베이스를 제공하는 C라이브러리
- SQLite는 프로토 타입을 만들 때까지 사용. 정식 제품은 오라클이나 다른 DBMS를 연결
- [[SQLite DB Browser](https://sqlitebrowser.org/dl/)]

In [1]:
import sqlite3
sqlite3.sqlite_version

'3.33.0'

## 1.2 데이터 베이스 연결

In [2]:
#DB연결 객체 생성시 파일이 없으면 파일 생성. 파일 있으면 해당 파일 연결
conn = sqlite3.connect('data/ch10_example.db')
conn

In [3]:
#커서 객체 반환. 커서는 SQL문을 실행시키고 결과 데이터를 조회하는데 사용
cursor = conn.cursor()

In [4]:
cursor.execute("""
    CREATE TABLE MEMBER(
        NAME TEXT,
        AGE INT,
        EMAIL TEXT
    )
""")

In [5]:
cursor.execute("DROP TABLE MEMBER")

In [6]:
cursor.execute("""
    CREATE TABLE MEMBER(
        NAME TEXT,
        AGE INT,
        EMAIL TEXT
    )
""")

In [7]:
cursor.execute("INSERT INTO MEMBER VALUES ('공지철', 43, 'kong@green.com')")
cursor.execute("INSERT INTO MEMBER VALUES ('한지민',39,'han@green.com')")
cursor.execute("INSERT INTO MEMBER VALUES ('윤여정',72,'yoon@green.com')")

In [8]:
conn.commit()  #<-> conn.rollback()

In [9]:
cursor.execute('SELECT NAME FROM MEMBER') #실행 결과는 cursor가 가리킴

<select문의 결과를 받는 함수>
- fetchall(); 결과를 모두 받을 때
- fetchone(); 결과를 한 행씩 받을 때
- fetchmany(n); 결과를 n행씩 받을 때

In [10]:
#select문 결과를 받는 함수: fetchall(), fetchone(), fetchmany(n)
print(cursor.fetchall())

[('공지철',), ('한지민',), ('윤여정',)]

In [11]:
print(cursor.fetchall()) #한번 fetch한 건 다시 데이터 가져올 수 없음(계속 사용하려면 변수에 담아서 사용)

[]

In [12]:
cursor.execute('SELECT * FROM MEMBER')
members = cursor.fetchall()
for member in members:
    print(member)

('공지철', 43, 'kong@green.com')
('한지민', 39, 'han@green.com')
('윤여정', 72, 'yoon@green.com')

In [13]:
members[0]

('공지철', 43, 'kong@green.com')

In [14]:
cursor.execute('SELECT * FROM MEMBER')
while True:
    member = cursor.fetchone()
    if member is None:
        break;
    print(member)

('공지철', 43, 'kong@green.com')
('한지민', 39, 'han@green.com')
('윤여정', 72, 'yoon@green.com')

In [15]:
cursor.execute('SELECT * FROM MEMBER')
for member in cursor.fetchmany(2):
    print(member[0], member[1], member[2]) #튜플로 나오지 않게 하려면

공지철 43 kong@green.com
한지민 39 han@green.com

In [16]:
cursor.fetchmany(2)

[('윤여정', 72, 'yoon@green.com')]

In [17]:
cursor.close() #생략 가능
conn.close()

## 1.3 SQL구문에 파라미터 사용하기
- qmark 스타일; 매개변수를 포함해야 할 값에 ?로 표시한 후 튜플을 통해 물음표에 전달할 값을 지정
- named 스타일(추천); 매개 변수를 포함해야 할 값 : 값을 받을 이름 표시한 후 딕셔너리 이용해 이름에 값 전달

In [20]:
#qmark 파라미터 사용
conn = sqlite3.connect('data/ch10_example.db')
cursor = conn.cursor()
cursor.execute('SELECT * FROM MEMBER WHERE NAME IN (?, ?)', ('공지철', '공유'))
print(cursor.fetchall())

[('공지철', 43, 'kong@green.com')]

In [21]:
name1 = input("검색할 이름1: ")
name2 = input("검색할 이름2: ")
names = (name1, name2)
cursor.execute('SELECT * FROM MEMBER WHERE NAME IN (?, ?)', names)
print(cursor.fetchall())

검색할 이름1: 한지민
검색할 이름2: 공지철
[('공지철', 43, 'kong@green.com'), ('한지민', 39, 'han@green.com')]

In [24]:
#named 파라미터 사용
name = input("검색할 이름: ")
cursor.execute('SELECT * FROM MEMBER WHERE NAME=:name', {'name':name})
members=cursor.fetchall()
if len(members)==0:
    print("해당 이름의 데이터가 없습니다")
else:
    print(members)

검색할 이름: 공유
해당 이름의 데이터가 없습니다

In [25]:
name = input("추가할 이름: ")
try:
    age = int(input("나이: "))
except ValueError:
    print("유효하지 않은 나이를 입력해서 20살로 처리")
    age=20
email=input("이메일: ")
cursor.execute("INSERT INTO MEMBER VALUES(:name, :age, :email)", {'name':name, 'age':age, 'email':email})

추가할 이름: 이지아
나이: 43
이메일: jia@green.com

In [26]:
cursor.execute('SELECT * FROM MEMBER')
print(cursor.fetchall())

[('공지철', 43, 'kong@green.com'), ('한지민', 39, 'han@green.com'), ('윤여정', 72, 'yoon@green.com'), ('이지아', 43, 'jia@green.com')]

# 2절. 오라클 데이터 베이스 연결

In [27]:
#Anaconda prompt 에서 cx_Oracle 설치
#pip install cx_Oracle
#pip show cx_Oracle

In [29]:
#데이터 베이스 설정(DBMS가 있는 서버 주소)
import cx_Oracle
oracle_dsn = cx_Oracle.makedsn(host="localhost", port=1521, sid="xe")
oracle_dsn

'(DESCRIPTION=(ADDRESS=(PROTOCOL=TCP)(HOST=localhost)(PORT=1521))(CONNECT_DATA=(SID=xe)))'

In [30]:
conn = cx_Oracle.connect("scott", "tiger", dsn=oracle_dsn)
conn
#에러가 날 경우 VC_redist.x64.exe 인스톨

In [31]:
#conn 가져오기(1)
oracle_dsn = cx_Oracle.makedsn(host="localhost", port=1521, sid="xe")
conn = cx_Oracle.connect("scott", "tiger", dsn=oracle_dsn)

In [32]:
conn.close()

In [34]:
#conn 가져오기(2)
conn = cx_Oracle.connect("scott", "tiger", "localhost:1521/xe")
conn

In [35]:
#cursor 가져오기
cursor = conn.cursor()

In [36]:
sql = "SELECT * FROM EMP"
cursor.execute(sql)
emp=cursor.fetchall()

In [37]:
for e in emp:
    print(e)

(7369, 'SMITH', 'CLERK', 7902, datetime.datetime(1980, 12, 17, 0, 0), 800.0, None, 20)
(7499, 'ALLEN', 'SALESMAN', 7698, datetime.datetime(1981, 2, 20, 0, 0), 1600.0, 300.0, 30)
(7521, 'WARD', 'SALESMAN', 7698, datetime.datetime(1981, 2, 22, 0, 0), 1250.0, 500.0, 30)
(7566, 'JONES', 'MANAGER', 7839, datetime.datetime(1981, 4, 2, 0, 0), 2975.0, None, 20)
(7654, 'MARTIN', 'SALESMAN', 7698, datetime.datetime(1981, 9, 28, 0, 0), 1250.0, 1400.0, 30)
(7698, 'BLAKE', 'MANAGER', 7839, datetime.datetime(1981, 5, 1, 0, 0), 2850.0, None, 30)
(7782, 'CLARK', 'MANAGER', 7839, datetime.datetime(1981, 6, 9, 0, 0), 2450.0, None, 10)
(7788, 'SCOTT', 'ANALYST', 7566, datetime.datetime(1982, 12, 9, 0, 0), 3000.0, None, 20)
(7839, 'KING', 'PRESIDENT', None, datetime.datetime(1981, 11, 17, 0, 0), 5000.0, None, 10)
(7844, 'TURNER', 'SALESMAN', 7698, datetime.datetime(1981, 9, 8, 0, 0), 1500.0, 0.0, 30)
(7876, 'ADAMS', 'CLERK', 7788, datetime.datetime(1983, 1, 12, 0, 0), 1100.0, None, 20)
(7900, 'JAMES', 'CLERK', 7698, datetime.datetime(1981, 12, 3, 0, 0), 950.0, None, 30)
(7902, 'FORD', 'ANALYST', 7566, datetime.datetime(1981, 12, 3, 0, 0), 3000.0, None, 20)
(7934, 'MILLER', 'CLERK', 7782, datetime.datetime(1982, 1, 23, 0, 0), 1300.0, None, 10)

In [38]:
#변수에 저장 안하고 한 번만 출력할 경우
sql= "SELECT * FROM EMP"
cursor.execute(sql)
for c in cursor:
    print(c)

(7369, 'SMITH', 'CLERK', 7902, datetime.datetime(1980, 12, 17, 0, 0), 800.0, None, 20)
(7499, 'ALLEN', 'SALESMAN', 7698, datetime.datetime(1981, 2, 20, 0, 0), 1600.0, 300.0, 30)
(7521, 'WARD', 'SALESMAN', 7698, datetime.datetime(1981, 2, 22, 0, 0), 1250.0, 500.0, 30)
(7566, 'JONES', 'MANAGER', 7839, datetime.datetime(1981, 4, 2, 0, 0), 2975.0, None, 20)
(7654, 'MARTIN', 'SALESMAN', 7698, datetime.datetime(1981, 9, 28, 0, 0), 1250.0, 1400.0, 30)
(7698, 'BLAKE', 'MANAGER', 7839, datetime.datetime(1981, 5, 1, 0, 0), 2850.0, None, 30)
(7782, 'CLARK', 'MANAGER', 7839, datetime.datetime(1981, 6, 9, 0, 0), 2450.0, None, 10)
(7788, 'SCOTT', 'ANALYST', 7566, datetime.datetime(1982, 12, 9, 0, 0), 3000.0, None, 20)
(7839, 'KING', 'PRESIDENT', None, datetime.datetime(1981, 11, 17, 0, 0), 5000.0, None, 10)
(7844, 'TURNER', 'SALESMAN', 7698, datetime.datetime(1981, 9, 8, 0, 0), 1500.0, 0.0, 30)
(7876, 'ADAMS', 'CLERK', 7788, datetime.datetime(1983, 1, 12, 0, 0), 1100.0, None, 20)
(7900, 'JAMES', 'CLERK', 7698, datetime.datetime(1981, 12, 3, 0, 0), 950.0, None, 30)
(7902, 'FORD', 'ANALYST', 7566, datetime.datetime(1981, 12, 3, 0, 0), 3000.0, None, 20)
(7934, 'MILLER', 'CLERK', 7782, datetime.datetime(1982, 1, 23, 0, 0), 1300.0, None, 10)

In [39]:
sql = 'SELECT * FROM EMP WHERE DEPTNO=:deptno'
deptno=input("검색하고자 하는 부서 번호는?")
cursor.execute(sql, {'deptno':deptno})
for emp in cursor:
    print(emp)

검색하고자 하는 부서 번호는?20
(7369, 'SMITH', 'CLERK', 7902, datetime.datetime(1980, 12, 17, 0, 0), 800.0, None, 20)
(7566, 'JONES', 'MANAGER', 7839, datetime.datetime(1981, 4, 2, 0, 0), 2975.0, None, 20)
(7788, 'SCOTT', 'ANALYST', 7566, datetime.datetime(1982, 12, 9, 0, 0), 3000.0, None, 20)
(7876, 'ADAMS', 'CLERK', 7788, datetime.datetime(1983, 1, 12, 0, 0), 1100.0, None, 20)
(7902, 'FORD', 'ANALYST', 7566, datetime.datetime(1981, 12, 3, 0, 0), 3000.0, None, 20)

In [40]:
sql = "SELECT * FROM EMP WHERE DEPTNO=:deptno"
deptno=input("검색하고자 하는 부서 번호는? ")
cursor.execute(sql, {'deptno':deptno})
emp = cursor.fetchall()
if len(emp)==0:
    print("입력한 부서번호의 데이터가 없습니다")
else:
    for e in emp:
        print(e)

검색하고자 하는 부서 번호는? 10
(7782, 'CLARK', 'MANAGER', 7839, datetime.datetime(1981, 6, 9, 0, 0), 2450.0, None, 10)
(7839, 'KING', 'PRESIDENT', None, datetime.datetime(1981, 11, 17, 0, 0), 5000.0, None, 10)
(7934, 'MILLER', 'CLERK', 7782, datetime.datetime(1982, 1, 23, 0, 0), 1300.0, None, 10)

In [41]:
import pandas as pd
cursor.execute("SELECT * FROM EMP")
data = cursor.fetchall() #튜플 리스트
data_df = pd.DataFrame(data) #데이터 프레임
data_df

       0       1          2       3          4       5       6   7
0   7369   SMITH      CLERK  7902.0 1980-12-17   800.0     NaN  20
1   7499   ALLEN   SALESMAN  7698.0 1981-02-20  1600.0   300.0  30
2   7521    WARD   SALESMAN  7698.0 1981-02-22  1250.0   500.0  30
3   7566   JONES    MANAGER  7839.0 1981-04-02  2975.0     NaN  20
4   7654  MARTIN   SALESMAN  7698.0 1981-09-28  1250.0  1400.0  30
5   7698   BLAKE    MANAGER  7839.0 1981-05-01  2850.0     NaN  30
6   7782   CLARK    MANAGER  7839.0 1981-06-09  2450.0     NaN  10
7   7788   SCOTT    ANALYST  7566.0 1982-12-09  3000.0     NaN  20
8   7839    KING  PRESIDENT     NaN 1981-11-17  5000.0     NaN  10
9   7844  TURNER   SALESMAN  7698.0 1981-09-08  1500.0     0.0  30
10  7876   ADAMS      CLERK  7788.0 1983-01-12  1100.0     NaN  20
11  7900   JAMES      CLERK  7698.0 1981-12-03   950.0     NaN  30
12  7902    FORD    ANALYST  7566.0 1981-12-03  3000.0     NaN  20
13  7934  MILLER      CLERK  7782.0 1982-01-23  1300.0     NaN  10

In [45]:
#각 필드 특징 정보(필드명, type, display_size, 내부 크기, 정확도, scale, nullable)
cursor.description

[('EMPNO', <cx_Oracle.DbType DB_TYPE_NUMBER>, 5, None, 4, 0, 0),
 ('ENAME', <cx_Oracle.DbType DB_TYPE_VARCHAR>, 10, 10, None, None, 1),
 ('JOB', <cx_Oracle.DbType DB_TYPE_VARCHAR>, 9, 9, None, None, 1),
 ('MGR', <cx_Oracle.DbType DB_TYPE_NUMBER>, 5, None, 4, 0, 1),
 ('HIREDATE', <cx_Oracle.DbType DB_TYPE_DATE>, 23, None, None, None, 1),
 ('SAL', <cx_Oracle.DbType DB_TYPE_NUMBER>, 11, None, 7, 2, 1),
 ('COMM', <cx_Oracle.DbType DB_TYPE_NUMBER>, 11, None, 7, 2, 1),
 ('DEPTNO', <cx_Oracle.DbType DB_TYPE_NUMBER>, 3, None, 2, 0, 1)]

In [46]:
[row[0] for row in cursor.description]

['EMPNO', 'ENAME', 'JOB', 'MGR', 'HIREDATE', 'SAL', 'COMM', 'DEPTNO']

In [47]:
data_df.columns

RangeIndex(start=0, stop=8, step=1)

In [48]:
data_df.columns = [row[0] for row in cursor.description]

In [49]:
data_df.columns

Index(['EMPNO', 'ENAME', 'JOB', 'MGR', 'HIREDATE', 'SAL', 'COMM', 'DEPTNO'], dtype='object')

In [50]:
data_df.head()

   EMPNO   ENAME       JOB     MGR   HIREDATE     SAL    COMM  DEPTNO
0   7369   SMITH     CLERK  7902.0 1980-12-17   800.0     NaN      20
1   7499   ALLEN  SALESMAN  7698.0 1981-02-20  1600.0   300.0      30
2   7521    WARD  SALESMAN  7698.0 1981-02-22  1250.0   500.0      30
3   7566   JONES   MANAGER  7839.0 1981-04-02  2975.0     NaN      20
4   7654  MARTIN  SALESMAN  7698.0 1981-09-28  1250.0  1400.0      30

In [51]:
data_df.tail()

    EMPNO   ENAME       JOB     MGR   HIREDATE     SAL  COMM  DEPTNO
9    7844  TURNER  SALESMAN  7698.0 1981-09-08  1500.0   0.0      30
10   7876   ADAMS     CLERK  7788.0 1983-01-12  1100.0   NaN      20
11   7900   JAMES     CLERK  7698.0 1981-12-03   950.0   NaN      30
12   7902    FORD   ANALYST  7566.0 1981-12-03  3000.0   NaN      20
13   7934  MILLER     CLERK  7782.0 1982-01-23  1300.0   NaN      10

In [52]:
cursor.close()
conn.close()

# 3절. MariaDB 연결

In [53]:
#Anaconda prompt(관리자 권한 실행) 에서 pip install pymysql설치
import pymysql

In [54]:
conn = pymysql.connect(host="localhost", port=3306, db="kimdb", user="root", passwd="mysql",
                      charset="utf8", autocommit=True)
conn

In [55]:
cursor=conn.cursor()
sql = "select * from personal"
cursor.execute(sql)
result = cursor.fetchall()
for r in result:
    print(r)

(1001, 'bill', 'president', None, datetime.date(1989, 1, 10), 7000, None, 10)
(1111, 'smith', 'manager', 1001, datetime.date(1990, 12, 17), 1000, None, 10)
(1112, 'ally', 'salesman', 1116, datetime.date(1991, 2, 20), 1600, 500, 30)
(1113, 'word', 'salesman', 1116, datetime.date(1992, 2, 24), 1450, 300, 30)
(1114, 'james', 'manager', 1001, datetime.date(1990, 4, 12), 3975, None, 20)
(1116, 'johnson', 'manager', 1001, datetime.date(1991, 5, 1), 3550, None, 30)
(1118, 'martin', 'analyst', 1111, datetime.date(1991, 9, 9), 3450, None, 10)
(1121, 'kim', 'clerk', 1114, datetime.date(1990, 12, 8), 4000, None, 20)
(1123, 'lee', 'salesman', 1116, datetime.date(1991, 9, 23), 1200, 0, 30)
(1226, 'park', 'analyst', 1111, datetime.date(1990, 1, 3), 2500, None, 10)

In [56]:
personal = pd.DataFrame(result)
personal.columns = [row[0] for row in cursor.description]
personal

    pno    pname        job  manager   startdate   pay  bonus  dno
0  1001     bill  president      NaN  1989-01-10  7000    NaN   10
1  1111    smith    manager   1001.0  1990-12-17  1000    NaN   10
2  1112     ally   salesman   1116.0  1991-02-20  1600  500.0   30
3  1113     word   salesman   1116.0  1992-02-24  1450  300.0   30
4  1114    james    manager   1001.0  1990-04-12  3975    NaN   20
5  1116  johnson    manager   1001.0  1991-05-01  3550    NaN   30
6  1118   martin    analyst   1111.0  1991-09-09  3450    NaN   10
7  1121      kim      clerk   1114.0  1990-12-08  4000    NaN   20
8  1123      lee   salesman   1116.0  1991-09-23  1200    0.0   30
9  1226     park    analyst   1111.0  1990-01-03  2500    NaN   10

In [57]:
personal = pd.DataFrame(result, columns=[row[0] for row in cursor.description])
personal

    pno    pname        job  manager   startdate   pay  bonus  dno
0  1001     bill  president      NaN  1989-01-10  7000    NaN   10
1  1111    smith    manager   1001.0  1990-12-17  1000    NaN   10
2  1112     ally   salesman   1116.0  1991-02-20  1600  500.0   30
3  1113     word   salesman   1116.0  1992-02-24  1450  300.0   30
4  1114    james    manager   1001.0  1990-04-12  3975    NaN   20
5  1116  johnson    manager   1001.0  1991-05-01  3550    NaN   30
6  1118   martin    analyst   1111.0  1991-09-09  3450    NaN   10
7  1121      kim      clerk   1114.0  1990-12-08  4000    NaN   20
8  1123      lee   salesman   1116.0  1991-09-23  1200    0.0   30
9  1226     park    analyst   1111.0  1990-01-03  2500    NaN   10

In [58]:
cursor.close()
conn.close()

# 4절. 회원 입력/조회(검색)/출력/삭제 애플리케이션
- SQLite 이용: ch10_db 폴더 ch10_SQLite 파일 참조
- Oracle 이용: ch10_db 폴더 ch10_Oracle 파일 참조